<h4>Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [4]:
list1=[4,8,15,16,23,42]
ser=pd.Series(list1)
ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

<h4>Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
list2=[1,2,3,4,5,6,7,8,9,10]
ser=pd.Series(list2)
ser

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

<h4>Q3. Create a Pandas DataFrame that contains the following data:
    then print that dataframe

In [6]:
dict={"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}
df=pd.DataFrame(dict)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

<h4>Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans. Data sets in Pandas are usually multi-dimensional tables, called DataFrames.
Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.

In [7]:
# Creating a DataFrame from a dictionary of Series
data = pd.DataFrame({
    "Class 1": pd.Series([22, 33, 38], index=["math avg", "science avg",  "english avg"]),
    "Class 2": pd.Series([45, 28, 36], index=["math avg", "science avg",  "english avg"]),
    "Class 3": pd.Series([32, 41, 47], index=["math avg", "science avg",  "english avg"])
})
 
data

             Class 1  Class 2  Class 3
math avg          22       45       32
science avg       33       28       41
english avg       38       36       47

In [8]:
#Creating a DataFrame from a dictionary of lists
data = {
    "Class 1": [22, 33, 38],
    "Class 2": [45, 28, 36], 
    "Class 3": [32, 41, 47]
}
df = pd.DataFrame(data=data, index=['math avg', 'science avg', 'english avg'])
 
df

             Class 1  Class 2  Class 3
math avg          22       45       32
science avg       33       28       41
english avg       38       36       47

<h4>Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [14]:
# (1) read_csv
df1=pd.read_csv("text.csv")

In [16]:
# (2)head
df1.head()

In [ ]:
# (3) tail
df1.tail()

In [18]:
# (4) describe
df1.describe()

In [20]:
# (5) columns
df1.columns

<h4>Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans. DataFrame and Panel are mutable

<h4>Q7. Create a DataFrame using multiple Series. Explain with an example.

In [21]:
data = pd.DataFrame({
    "Class 1": pd.Series([22, 33, 38], index=["math avg", "science avg",  "english avg"]),
    "Class 2": pd.Series([45, 28, 36], index=["math avg", "science avg",  "english avg"]),
    "Class 3": pd.Series([32, 41, 47], index=["math avg", "science avg",  "english avg"])
})
 
data

             Class 1  Class 2  Class 3
math avg          22       45       32
science avg       33       28       41
english avg       38       36       47